# --------------------------------
p1, p2, q1, q2 = int(input()), int(input()), int(input()), int(input())
sum1 = abs(p1 - q1) + abs(p2 - q2)
print(sum1)

# ----------------------------------
# a = int(input())
# a1 = a//100
# a2 = a//10%10
# a3 = a%10
# max1 = max(a1, a2, a3)
# min1 = min(a1, a2, a3)
# med = (max1 - min1)
# s = a1 + a2 + a3 - max1 - min1
# if med == s:
#     print('Число интересное')
# else:
#     print('Число неинтересное')

# -----------------------------------
# программа, которая упорядочивает три числа от большего к меньшему
# a, b, c = int(input()), int(input()), int(input())
# max1 = max(a, b, c)
# min1 = min(a, b, c)
# med = a + b + c - max1 - min1
# print(max1)
# print(med)
# print(min1)

# -----------------------------------
# a, b, c, d, e = int(input()), int(input()), int(input()), int(input()), int(input())
# max1 = max(a, b, c, d, e)
# min1 = min(a, b, c, d, e)
# print('Наименьшее число =', min1)
# print('Наибольшее число =', max1)

# ---------------------------------
# Дано положительное действительное число. Выведите его дробную часть
# a = float(input())
# a1 = int(a)
# b = a - a1
# print(b)

# -----------------------------------
# a = float(input())
# a1 = int(a)
# b = (a - a1)*10
# print(int(b))

# -------------------------------------
# количество собачьих лет
# a = int(input())
# if 0 <= a <= 2:
#     old1 = a * 10.5
#     print(old1)
# elif a > 2:
#     old = 21 + (a-2) * 4
#     print(old)

# -------------------------------------
# перевод фаренгейты в цельсии
# f = float(input())
# c = 5/9*(f - 32)
# print(c)

# -------------------------------------
# a = float(input())
# if a == 0:
#     print('Обратного числа не существует')
# else:
#     print(1/a)

# -------------------------------------
# Две старушки идут навстречу друг другу с постоянными скоростями V1 и V2 км/ч.
# Определите, через какое время (в часах) старушки встретятся, если расстояние между ними равно S км
# s = float(input())
# v1 = float(input())
# v2 = float(input())
# t = s/(v1 + v2)
# print(t)

# ------------------------------------------------------
# программа, считывает длины двух катетов в прямоугольном треугольнике и выводит его площадь
# a = float(input())
# b = float(input())
# s = 1/2*a*b
# print(s)

# ---------------------------------------
# программа демонстрирует все целочисленные операторы:
# a = 13
# b = 7
#
# total = a + b
# diff = a - b
# prod = a * b
# div1 = a / b
# div2 = a // b
# mod = a % b
# exp = a ** b
#
# print(a, '+', b, '=', total)
# print(a, '-', b, '=', diff)
# print(a, '*', b, '=', prod)
# print(a, '/', b, '=', div1)
# print(a, '//', b, '=', div2)
# print(a, '%', b, '=', mod)
# print(a, '**', b, '=', exp)
