
# --------------------------------------
# x1 = int(input())
# y1 = int(input())
# x2 = int(input())
# y2 = int(input())
# a = x2 - x1
# b = y2 - y1
# if (-1 <= a <= 1) and (-1 <= b <= 1):
#     print('YES')
# else:
#     print('NO')

# -------------------------------------
# определяет, является ли год с данным номером високосным.
# print('введите год:')
# a = int(input())
# if a % 4 == 0 and a % 100 != 0 or a % 400 == 0:
#     print('Год високосный')
# else:
#     print('Год не високосный')

# ----------------------------------
#принимает три положительных числа и определяет, существует
# ли невырожденный треугольник с такими сторонами.
# a = int(input())
# b = int(input())
# c = int(input())
# if (a + b) >c and (a + c) > b and (b + c) > a:
#     print('YES')
# else:
#     print('NO')

# -------------------------------------
# a = int(input())
# if 1000 <= a <= 9999 and (a % 7 == 0 or a % 17 == 0):
#
#     print('YES')
# else:
#     print('NO')

# -------------------------------------
# a = int(input())
# if -30 < a <= -3 or 7 <= a <= 25:
#     print('Принадлежит')
# else:
#     print('Не принадлежит')

# -------------------------------------
# a = int(input())
# if a <= -3 or a >= 7:
#     print('Принадлежит')
# else:
#     print('Не принадлежит')
# -------------------------------------
# age = int(input('Сколько вам лет?: '))
#
# if not (age < 12):
#     print('Доступ разрешен.')
# else:
#     print('Доступ запрещен.')

# -------------------------------------
# age = int(input('Сколько вам лет?: '))
# grade = int(input('В каком классе вы учитесь?: '))
# city = input('В каком городе вы живете?: ')
#
# if age >= 12 and grade >= 7 and (city == 'Москва' or city == 'Санкт-Петербург'):
#     print('Доступ разрешен.')
# else:
#     print('Доступ запрещен.')

# -------------------------------------
# city = input('В каком городе вы живете?: ')
# if city == 'Москва' or city == 'Санкт-Петербург' or city == 'Екатеринбург':
#     print('Доступ разрешен.')
# else:
#     print('Доступ запрещен.')

# ---------------------------------
# age = int(input('Сколько вам лет?: '))
# grade = int(input('В каком классе вы учитесь?: '))
# city = input('В каком городе вы живете?: ')
#
# if age >= 12 and grade >= 7 and city == 'Москва':
#     print('Доступ разрешен.')
# else:
#     print('Доступ запрещен.')

# ----------------------------------
# age = int(input('Сколько вам лет?: '))
# grade = int(input('В каком классе вы учитесь?: '))
#
# if age >= 12 and grade >= 7:
#     print('Доступ разрешен.')
# else:
#     print('Доступ запрещен.')
