"""Индексация. Тема урока: строки.
Индексация строк
Итерирование строк
Решение задач
"""
# s = input()  # считали текст
# num = int(input())  # считали текст и преобразовали его в целое число
# s = 'Hello'
# n = len(s)  # значение переменной равно 5
# print(n)
# -----------------------------------------
# s = 'All you need is love'
# if 'love' in s:
#     print('❤️')
# else:
#     print('💔')
# --------------------------------------------
# Итерирование строк
# s = 'abcdef'
# for i in range(len(s)):
#     print(s[i])
# ----------------------
# s = 'abcdef'
# for c in s:
#     print(c)
# --------------------------------------------
# s = '01234567891011121314151617'
# for i in range(0, len(s), 5):
#     print(s[i], end='')
# # > 051217
# ------------------------------------
# s = "In 2010, someone paid 10k Bitcoin for two pizzas."
# print(s[39])
# -----------------------------------------------------
# В столбик 1
# s = str(input())
# for i in range(0, len(s), 2):
#     print(s[i])
# ---------------------------------------------------
# В столбик 2
# s = str(input())
# x = len(s)
# for i in range(-1, -(x+1), -1):
#     print(s[i])
# ---------------------------------------------------
# ФИО
# i, f, o = str(input()), str(input()), str(input())
# print(f[0] + i[0] + o[0])
# ----------------------------------------------------
# Цифра 1
# s = str(input())
# k = 0
# for i in range(0, len(s)):
#     k += int(s[i])
# print(k)
# ----------------------------------------------
# Цифра 2
# s = input()
# k = 0
# for i in s:
#     if i.isdigit():
#         k += 1
# if k > 0:
#     print("Цифра")
# else:
#     print("Цифр нет")
# ----------------------------------------------
# Сколько раз?
# s = input()
# k, n = 0, 0
# for i in s:
#     if i == '+':
#         k += 1
#     if i == '*':
#         n += 1
# print("Символ + встречается", k, 'раз')
# print("Символ * встречается", n, 'раз')
# ----------------------------------------------
# Одинаковые соседи. Программа, которая определяет сколько в ней одинаковых
# соседних символов.
# s = input()
# k = 0
# q = len(s)
# for i in range(1, q):
#     if s[-i] == s[-i-1]:
#         k += 1
# print(k)
# ----------------------------------------------
# Гласные и согласные/ Подсчет гласных и согласных в строке
# sogl = 'бвгджзйклмнпрстфхцчшщ'
# gl = 'аеёиоуыэюя'
# s = input().lower()
# sum_gl, sum_sogl = 0, 0
# for i in range(len(s)):
#     for k in range(len(gl)):
#         if s[i] == gl[k]:
#             sum_gl += 1
#     for n in range(len(sogl)):
#         if s[i] == sogl[n]:
#             sum_sogl += 1
# print("Количество гласных букв равно", sum_gl)
# print("Количество согласных букв равно", sum_sogl)
# ---------------------------------------------------
# Decimal to Binary
# На вход программе подается натуральное число, записанное в десятичной системе счисления.
# Напишите программу, которая переводит данное число в двоичную систему счисления
a = int(input())
b = ""
while a > 0:
    b = str(a % 2) + b
    a = a // 2
print(b)
