""" Тема урока: цикл for. Функция range() с одним параметром, Функции range() с двумя параметрами,
Функции range() с тремя параметрами """

# -------------------------------------------
# for i in range(100, 1000):  # перебираем числа от 100 до 999
#     if i % 10 == 7:         # используем остаток от деления на 10, для получения последней цифры
#         print(i)
# ----------------------------------------------
# for i in range(56, 171, 2):  # Перегрузка range() с 3 параметрами
#     print(i)
# ----------------------------------------------
# for i in range(5, 0, -1):  # Отрицательный шаг генерации
#     print(i, end=' ')
# print('Взлетаем!!!')
# -----------------------------------------------
# программа, которая выводит все целые числа от
# m, n = int(input()), int(input())
# if m < n and n <= 0 or m < n and n > 0 and m <= 0 or m < n and n > 0 and m > 0:
#      for i in range(m, n+1):
#           print(i)
# if m > n and m <= 0 or m > n and m > 0 and n <= 0 or m > 0 and n >= 0:
#      for i in range(m, n-1, -1):
#           print(i)

# ---------------------------------------
# Последовательность чисел 3
# m, n = int(input()), int(input())
# if m <= 0 and m % 2 == 0 and n % 2 == 0:   # отрицательный диапазон четные числа
#     for i in range(m - 1, n, -2):
#         print(i)
# if m <= 0 and m % 2 == 0 and n % 2 == 1:  # отрицательный диапазон  m - четнoe, n - не четное
#     for i in range(m - 1, n - 1, -2):
#         print(i)
#
# if m <= 0 and m % 2 == 1 and n % 2 == 1:  # отрицательный диапазон не четные числа
#     for i in range(m, n - 1, -2):
#         print(i)
# if m <= 0 and m % 2 == 1 and n % 2 == 0:  # отрицательный диапазон m - не четное, n - четное
#     for i in range(m, n - 1, -2):
#         print(i)
#
# if n >= 0 and m % 2 == 0 and n % 2 == 0:  # положительный диапазон четные числа
#     for i in range(m -1 , n, -2):
#         print(i)
# if n >= 0 and m % 2 == 0 and n % 2 == 1:  # положительный диапазон m - четное, n - не четное
#     for i in range(m - 1, n - 1, -2):
#         print(i)
# if n >= 0 and m % 2 == 1 and n % 2 == 1:  # положительный диапазон не четные числа
#     for i in range(m, n - 1, -2):
#         print(i)
# if n >= 0 and m % 2 == 1 and n % 2 == 0:  # положительный диапазон m - не четное, n - четное
#     for i in range(m, n, -2):
#         print(i)
#
# if n < 0 < m and m % 2 == 0 and n % 2 == 0:  # диапазон от отрицательных до положительных значений, четные числа
#     for i in range(m - 1, n, -2):
#         print(i)
# if n < 0 < m and m % 2 == 0 and n % 2 == 1: # диапазон от отрицательных до положительных значений, m - четное, n - не четное
#     for i in range(m - 1, n - 1, -2):
#         print(i)
# if n < 0 < m and m % 2 == 1 and n % 2 == 1:  # диапазон от отрицательных до положительных значений, не четные числа
#     for i in range(m, n - 1, -2):
#         print(i)
# if n < 0 < m and m % 2 == 1 and n % 2 == 0:  # диапазон от отрицательных до положительных значений, m -  не четное, n - четное
#     for i in range(m, n, -2):
#         print(i)

# -----------------------------------------------------
# # Последовательность чисел 3
# m = int(input())
# n = int(input())
# for i in range(m - (m % 2 == 0), n - 1, -2):
#     print(i)
# -------------------------------------------------------
# Последовательность чисел 4
# m = int(input())
# n = int(input())
# for i in range(m, n+1):
#     if i % 17 == 0 or i % 3 == 0 and i % 5 == 0 or i%10 == 9:
#         print(i)
# --------------------------------------------------------
# Таблица умножения
# a = int(input())
# for i in range(1, 11):
#     c = a * i
#     print(a, 'x', i, '=', c)



