"""
Тема урока: вложенные циклы
Вложенные циклы, Операторы break и continue во вложенных циклах.
"""
# for hours in range(24):
#     for minutes in range(60):
#         for seconds in range(60):
#             print(hours, ':', minutes, ':', seconds)
# ---------------------------------------------------------
# for i in range(3):
#     for j in range(3):
#         print(i, j)
# -------------------------------
# for i in range(3):
#     for j in range(3):
#         if i == j:
#             break
#         print(i, j)
# --------------------------------------
# for i in range(3):
#     for j in range(3):
#         if i == j:
#             continue
#         print(i, j)
# -----------------------------------------
# for i in range(6):
#     for j in range(6):
#         print('*', end='')
#     print()
# ---------------------------------------
# for i in range(8):
#     for j in range(i + 1):
#         print('*', end='')
#     print()
# ----------------------------------------
# for i in range(1, 4):
#     for j in range(3, 6):
#         print(i, j)
# --------------------------------------
# for i in range(1, 4):
#     for j in range(3, 5):
#         print(i + j, end='')
# --------------------------------------
# counter = 0
# for i in range(99, 102):
#     temp = i
#     while temp > 0:
#         counter += 1
#         temp //= 10
#         print(counter)
# print(counter)
# ---------------------------------------------------------
# Таблица-1. программу, которая печатает таблицу размером n×3
# состоящую из данного числа (числа отделены одним пробелом).
# n = int(input())
# for i in range(n):
#     for j in range(3):
#         print(n, end=' ')
#     print()
# ---------------------------------------------------------
# Таблица-2
# программа, которая печатает таблицу размером n×5, где в i-ой строке указано
# число i (числа отделены одним пробелом).
# n = int(input())
# for i in range(1, n+1):
#     for j in range(5):
#         print(i, end=' ')
#     print()
# ---------------------------------------------------------
# Таблица-3. Дано натуральное число n (n≤ 9). Напишите программу,
# которая печатает таблицу сложения для всех чисел от 1 до n (включительно) в соответствии с примером.
# n = int(input())
# for i in range(1, n+1):
#     for j in range(1, 10):
#         print(i, '+', j, "=", i+j)
#     print()
# ----------------------------------------------------------
# Звездный треугольник. Напишите программу, которая печатает равнобедренный
# звездный треугольник с основанием, равным n в соответствии с примером
# n = int(input())
# for i in range((n // 2) + 1):
#     for j in range(i + 1):
#         print('*', end='')
#     print()
# for i in range(n // 2):
#     for j in range((n // 2) - i):
#         print('*', end='')
#     print()
# ----------------------------------------------------------
# Численный треугольник 1. Программа, которая печатает численный треугольник
# n = int(input())
# for i in range(n):
#     for j in range(i + 1):
#         print(i+1, end='')
#     print()
# ---------------------------------------------------------
"""Использование вложенных циклов при решении уравнений"""
# Задача 1. Найдите все пары натуральных чисел (и их количество),
# являющихся решением уравнения 12х+13y=777
# total = 0
# for x in range(1, 65):
#     for y in range(1, 60):
#         if 12 * x + 13 * y == 777:
#             total += 1
#             print('x =', x, 'y =', y)
# print('Общее количество натуральных решений =', total)
# -----------------------------------------------------
# Задача 2. Найдите все тройки натуральных чисел (и их количество),
# являющихся решением уравнения x2+y2+z2=2020
# total = 0
# for x in range(1, 45):
#     for y in range(1, 45):
#         for z in range(1, 45):
#             if x ** 2 + y ** 2 + z ** 2 == 2020:
#                 total += 1
#                 print('x =', x, 'y =', y, 'z =', z)
# print('Общее количество натуральных решений =', total)
# ---------------------------------------------
# Решите уравнение в натуральных числах 28n+30k+31m=365
# total = 0
# for n in range(1, 65):
#     for k in range(1, 60):
#         for m in range(1, 60):
#             if 28 * n + 30 * k + 31 * m == 365:
#                 total += 1
#                 print('n =', n, 'k =', k, 'm =', m)
# print('Общее количество натуральных решений =', total)
# -----------------------------------------------------
# Старинная задача.
# Имеется 100 рублей. Сколько быков, коров и телят можно купить на все эти деньги, если плата за быка –
# 10 рублей, за корову – 5 рублей, за теленка – 0.5 рубля и надо купить 100 голов скота?
# total = 0
# for n in range(1, 50):
#     for k in range(1, 50):
#         for m in range(1, 100):
#             if 10 * n + 5 * k + 0.5 * m == 100:
#                 total += 1
#                 print('n =', n, 'k =', k, 'm =', m)
# print('Общее количество натуральных решений =', total)
# ---------------------------------------------------
# Гипотеза Эйлера о сумме степеней.
# Найдите пять натуральных чисел a,b,c,d,e удовлетворяющих условию: a5+b5+c5+d5=e5
for a in range(1, 150):
    for b in range(a+1, 150):
        for c in range(b+1, 150):
            for d in range(c+1, 150):
                e = int(((a ** 5) + (b ** 5) + (c ** 5) + (d ** 5))**0.2)
                if e ** 5 == int((a ** 5) + (b ** 5) + (c ** 5) + (d ** 5)):
                    print('a =', a, 'b =', b, 'c =', c, 'd =', d,  'e =', e)
                    print('a + b + c + d + e =', a + b + c + d + e)
# --------------------------------------------------------------
